# -*- coding: utf-8 -*-
"""
Created on Fri Apr  9 15:07:13 2021

@author: Vivian
"""


'''語法錯誤 Syntax error'''
'''在寫程式的時候寫出電腦看不懂的腳本(script)。'''
# NameError =================================================================
# 第一種：未命名的function(函式)
pritn('Hello World!')
# >>> NameError: name 'pritn' is not defined


# 第二種：未命名的variable(變數)
if x == y :
    print('yes')
# >>> NameError: name 'x' is not defined
# # =========================================================================

# SyntaxError ===============================================================
# 第一種：string 沒有被寫完整
print('Hello World!!)
# >>> SyntaxError: EOL while scanning string literal

# # =========================================================================


# TypeError =================================================================
print('1'+1)
# >>> TypeError: can only concatenate str (not "int") to str
# # =========================================================================








'''邏輯錯誤 Logical error'''
'''語法沒有錯誤且程式可以執行的情況下，輸出的結果卻不合理'''
# 想要將台幣換算成美元，卻用錯誤的算法
# 台幣30元可以換成1美元
TWD = 30
print('台幣TWD換算成美元後，總共：',TWD*30,'美元')








'''執行錯誤 Execution error'''
'''當程式執行到一半時，被電腦強制結束，無法執行完畢，就是發生執行錯誤。'''
# # ZeroDivisionError =======================================================
z = 1/0
# >>> ZeroDivisionError: division by zero
# # =========================================================================

# # IndexError ==============================================================
list_1 = [1,2,3]
print(list_1[3])
# >>> IndexError: list index out of range
# # =========================================================================